[BalanceDefs.MailboxTurnIn InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[BalanceDefs.TaggartMissionDirector InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_MO_TaggartBiography_MissionGiver MissionItemDefinition]
UseFailureCharacterMessage="It should %s Use this article."
ItemName="Taggart's ECHO device"
PickupMessage="You are there %s"
UseFailureLevelMessage="You must be at least %d to use this feature."
UseFailureConstraintsMessage="This item is for sale."
NoManufacturerName="Who is driving?"

[ItemDefs.ID_MO_TaggartBiography_MissionGiver:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description=""
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_TaggartEchoRecorder MissionItemDefinition]
UseFailureCharacterMessage="you should %s Take advantage of this article.."
ItemName="Ecological device"
PickupMessage="you have %s"
UseFailureLevelMessage="You must be at least %d to use this item."
UseFailureConstraintsMessage="This is not allowed."
NoManufacturerName="General goods"

[ItemDefs.ID_TaggartEchoRecorder:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Eddie B, secondary ECHO activist. About Taggart's work."
NoConstraintText=""
Suffix=""
Prefix=""

